app/controllers/customers_controller.rb

SELECT * FROM `customers`
---
  def index
    @customers = Customer.paginate :page => params[:page], :order => 'updated_at DESC'

INSERT INTO `customers` (`middle_name`, `date_of_birth`, `email`, `signature_updated_at`, `photo_file_size`, `last_name`, `local_ref_contact_number`, `local_ref_address`, `contact_number`, `photo_updated_at`, `signature_file_name`, `first_name`, `created_at`, `photo_content_type`, `address`, `updated_at`, `signature_file_size`, `signature_content_type`, `nationality`, `local_ref_full_name`, `photo_file_name`) VALUES('', '2018-09-07', 'farishaummimath@gmail.com', NULL, NULL, 'Ummimath', NULL, NULL, 121312432545, NULL, NULL, 'Farisha', '2018-09-07 11:54:26', NULL, 'dfd', '2018-09-07 11:54:26', NULL, NULL, 'India', NULL, NULL)
---
  def create
    @customer = Customer.new(params[:customer])
    @customer.application_number = rand(36**10).to_s(36)
    if @customer.save