app/controllers/employees_controller.rb

SELECT * FROM `employees`
---
  def index
    @employees = Employee.all