app/controllers/users_controller.rb

  def index
    #@users= User.all
    @users = User.paginate :page => params[:page], :order => 'updated_at DESC'
---
SELECT * FROM `users`